{
  "headers": {
    "about": "ABOUT",
    "contact": "CONTACT",
    "languages": {
      "languages": "LANGUAGES",
      "english": "English - C1",
      "russian": "Russian - A2",
      "polish": "Polish - native"
    },
    "links": "LINKS",
    "hobbies": "HOBBIES",
    "experience": "EXPERIENCE",
    "education": "EDUCATION",
    "selected-projects": "SELECTED PROJECTS",
    "skills": "SKILLS AND TOOLS",
    "download": "DOWNLOAD"
  },
  "aboutme": "",
  "experience": [
    {
      "company": "BUSINESS SERVICE GALOP",
      "position": "Front-End Developer",
      "duration": "May 2024 - present",
      "duties": {
        "1": "Updating and expanding the internal event management system with new functionalities, system optimizations, and bug fixes; designed a new participant zone integrated into the event websites; created a dedicated system instance tailored to the needs of a major client, supporting diverse medical courses and events",
        "2": "Developing dedicated front-end solutions for medical events (customized registration forms and websites, participant zones, API integrations), VOD platform and responsive mailings compatible across all major email services",
        "3": "Developed a mobile application for Zebra data collectors (QR code scanning with local data storage) and a web application for attendance tracking during event sessions, supporting both self-scanning kiosks and Zebra scanners",
        "4": "Built a customizable live voting application with an administrative panel and real-time results; developed virtual exhibitor booths with documentation for partner companies",
        "5": "Providing onsite IT support during events across Poland, ensuring smooth operation of software systems and hardware reliability; assisting event participants when needed, including at international conferences; representing the IT department during international meetings and occasionally serving as a company driver"
      }
    },
    {
      "company": "ANFATA GAMES",
      "position": "Junior Web3 Frontend Developer",
      "duration": "Sep 2022 - Aug 2023",
      "duties": {
        "1": "Developed a decentralized application integrated with Smart Contracts and ImmutableX collections, including building a marketplace, bridging NFTs between L1 and L2, enabling transfers between accounts, and implementing a live auction system.",
        "2": "Worked with Moralis and Firebase databases and cloud functions, using TypeScript, Next.js, GSAP, and version control systems like GitLab and Bitbucket",
        "3": "Implemented a new homepage, integrated a Sanity CMS blog system, and built custom event-oriented websites and features across company platforms",
        "4": "Performed manual testing of Pirates of the Arrland, including the 3D MOBA game and 2D strategic map components within the decentralized app",
        "5": "Collaborated closely with cross-functional and international teams to deliver integrated Web3 experiences"
      }
    }
  ],
  "education": {
    "university": "UNIVERSITY OF SILESIA",
    "field": "Web Application Programming",
    "degree": "Enigneer degree",
    "dates": "October 2017 - June 2021"
  },
  "projects": [
    {
      "title": "POLONEZ AUTODRIVE",
      "technologies": "HTML • JavaScript • Three.js • 3D Studio Max 2019",
      "description": "Simple Three.js scene made with 3D Studio Max 2019. Models with animations were exported to .fbx files and baked into Synthwave/80's vibe 'coloring book' like animation with built-in GUI to play with scene colors and models. Turn on some music and have fun with coloring!",
      "repositoryLink": "https://github.com/SkorczanFFF/Polonez-Autodrive",
      "demoLink": "https://skorczanfff.github.io/Polonez-Autodrive/"
    },
    {
      "title": "MSKORUS - PORTFOLIO PAGE",
      "technologies": "Next.js • TypeScript • TailwindCSS • React Three Fiber/Three.js • Blender",
      "description": "Remaster of my deprecated React portfolio page. Now it's based on Next.js with TailwindCSS and TypeScript. Some parts of WebGL scene are GLTF models made in Blender and converted to React Three Fiber JSX components for better operating. Now features built-in web version of resume in English and Polish.",
      "repositoryLink": "https://github.com/SkorczanFFF/mskorus-remaster",
      "demoLink": "https://mskorus.vercel.app/"
    },

    {
      "title": "YET ANOTHER WEATHER APP",
      "technologies": "React • JavaScript • Sass • Vanta.js • OpenWeather API",
      "description": "Another 'weather application', but with a breath of fresh air. Weather informations are displayed for the selected city or by geolocation of the user, and the interface has been enriched with additional possibilities to interact with displayed weather data and background. Unfortunately, still desktop only.",
      "repositoryLink": "https://github.com/SkorczanFFF/YetAnotherWeatherApp",
      "demoLink": "https://skorczanfff.github.io/YetAnotherWeatherApp/"
    }
  ],
  "rodo": "I agree to the processing of personal data provided in this document for realising the recruitment process pursuant to the Personal Data Protection Act of 10 May 2018 (Journal of Laws 2018, item 1000) and in agreement with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)"
}
