{
  "headers": {
    "about": "ABOUT",
    "contact": "CONTACT",
    "languages": {
      "languages": "LANGUAGES",
      "english": "English - C1",
      "russian": "Russian - A2",
      "polish": "Polish - native"
    },
    "links": "LINKS",
    "hobbies": "HOBBIES",
    "experience": "EXPERIENCE",
    "education": "EDUCATION",
    "selected-projects": "SELECTED PROJECTS",
    "skills": "SKILLS AND TOOLS",
    "download": "DOWNLOAD"
  },
  "aboutme": "I am a motivated developer with a deep enthusiasm for cutting-edge web technologies, with a strong interest in WebGL. With my first experience in the Blockchain in game development industry and curiosity about the possibilities of web development, my goal is to create and deliver exceptional web experiences. I am constantly looking for new challenges in the evolving field of technology and currently looking for a new team to grow with and achieve something special and innovative together.",
  "experience": {
    "company": "ANFATA GAMES SP. Z O.O.",
    "position": "JUNIOR WEB 3.0 FRONTEND DEVELOPER",
    "duration": "[ September 2022 - June 2023 ]",
    "duties": {
      "1": "Development of decentralized app and auction system, integration with Smart Contracts and ImmutableX collections (marketplace, bridging between L1 and L2, transfers, etc.)",
      "2": "Working with Moralis and Firebase cloud functions and databases, TypeScript, Next.js and version control systems",
      "3": "Implementation of a new homepage, integration with Sanity CMS blog system, handling custom events on company apps and sites",
      "4": "Cross-team collaboration in cross-national team for consistent user experience with company products"
    }
  },
  "education": {
    "university": "UNIVERSITY OF SILESIA",
    "field": "INFORMATICS - Web Application Programming",
    "degree": "Enigneer degree • October 2017 - June 2021"
  },
  "projects": [
    {
      "title": "MSKORUS - PORTFOLIO PAGE",
      "technologies": "Next.js • TypeScript • TailwindCSS • React Three Fiber/Three.js • Blender",
      "description": "Remaster of my deprecated React portfolio page. Now it's based on Next.js with TailwindCSS and TypeScript. Some parts of WebGL scene are GLTF models made in Blender and converted to React Three Fiber JSX components for better operating. Now features built-in web version of resume in English and Polish.",
      "repositoryLink": "https://github.com/SkorczanFFF/mskorus-remaster",
      "demoLink": "https://mskorus.vercel.app/"
    },
    {
      "title": "POLONEZ AUTODRIVE",
      "technologies": "HTML • JavaScript • Three.js • 3D Studio Max 2019",
      "description": "Simple Three.js scene made with 3D Studio Max 2019. Models with animations were exported to .fbx files and baked into Synthwave/80's vibe 'coloring book' like animation with built-in GUI to play with scene colors and models. Turn on some music and have fun with coloring!",
      "repositoryLink": "https://github.com/SkorczanFFF/Polonez-Autodrive",
      "demoLink": "https://skorczanfff.github.io/Polonez-Autodrive/"
    },
    {
      "title": "YET ANOTHER WEATHER APP",
      "technologies": "React • JavaScript • Sass • Vanta.js • OpenWeather API",
      "description": "Another 'weather application', but with a breath of fresh air. Weather informations are displayed for the selected city or by geolocation of the user, and the interface has been enriched with additional possibilities to interact with displayed weather data and background. Unfortunately, still desktop only.",
      "repositoryLink": "https://github.com/SkorczanFFF/YetAnotherWeatherApp",
      "demoLink": "https://skorczanfff.github.io/YetAnotherWeatherApp/"
    }
  ],
  "rodo": "I agree to the processing of personal data provided in this document for realising the recruitment process pursuant to the Personal Data Protection Act of 10 May 2018 (Journal of Laws 2018, item 1000) and in agreement with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)"
}
