{
  "headers": {
    "about": "O MNIE",
    "contact": "KONTAKT",
    "languages": {
      "languages": "JĘZYKI",
      "english": "Angielski - C1",
      "russian": "Rosyjski - A2",
      "polish": "Polski - ojczysty"
    },
    "links": "LINKI",
    "hobbies": "ZAINTERESOWANIA",
    "experience": "DOŚWIADCZENIE",
    "education": "EDUKACJA",
    "selected-projects": "WYBRANE PROJEKTY",
    "skills": "UMIEJĘTNOŚCI I NARZĘDZIA",
    "download": "POBIERZ"
  },
  "aboutme": "Jestem programistą łączącym ciekawość z pasją do najnowocześniejszych technologii internetowych, który nieustannie poszukujE kolejnych wyzwań. Hobbistyczne zainteresowanie WebGL oraz pierwsze zdobyte doświadczenie podczas tworzenia gry opartej o technologię Blockchain, ukształtowało mój cel, którym stało się tworzenie i dostarczanie wyjątkowych doświadczeń dostępnych z poziomu przeglądarki internetowej. Aktualnie szukam nowego zespołu z którym mógłbym się rozwijać, dzielić wiedzą i świętować wspólnie odniesione sukcesy.",
  "experience": {
    "company": "ANFATA GAMES SP. Z O.O.",
    "position": "JUNIOR WEB 3.0 FRONTEND DEVELOPER",
    "duration": "[ 1 rok ]",
    "duties": {
      "1": "Rozwój zdecentralizowanej aplikacji i systemu aukcyjnego, integracja ze Smart Contractami oraz kolekcjami ImmutableX (budowa marketplace, bridging pomiędzy L1 a L2, transfery itp.)",
      "2": "Praca z Cloud Funkcjami baz danych Moralis i Firebase, TypeScript,Next.js oraz systemami kontroli wersji",
      "3": "Implementacja nowej strony głównej tworzonej gry, integracja z CMS Sanity, obsługa wydarzeń specjalnych",
      "4": "Współpraca międzyzespołowa w zespole międzynarodowym dla końcowej spójności tworzonych rozwiązań"
    }
  },
  "education": {
    "university": "UŚ - Wydział Nauk Ścisłych i Technicznych",
    "field": "INFORMATYKA - Programowanie Aplikacji Webowych",
    "degree": "Inżynier • Październik 2017 - Czerwiec 2021"
  },
  "projects": [
    {
      "title": "MSKORUS - PORTFOLIO",
      "technologies": "Next.js • TypeScript • TailwindCSS • React Three Fiber/Three.js • Blender",
      "description": "Przebudowana od podstaw przestarzała wersja mojego portfolio. Aktualnie bazuje na Next.js, TypeScript oraz TailwindCSS. Elementy sceny WebGL są modelami wykonanymi w Blender, następnie zostały skonwertowane do komponentów JSX biblioteki React Three Fiber dla prostrzego operowania elementami sceny. Zawiera wbudowaną wersję webową CV w języku polskim i angielskim.",
      "repositoryLink": "https://github.com/SkorczanFFF/mskorus-remaster",
      "demoLink": "https://mskorus.vercel.app/"
    },
    {
      "title": "POLONEZ AUTODRIVE",
      "technologies": "HTML • JavaScript • Three.js • 3D Studio Max 2019",
      "description": "Prosta trójwymiarowa animacja wykonana przy pomocy 3D Studio Max 2019 oraz Three.js. Wyeksportowane modele wraz z animacjami w formacie .fbx zostały połączone w scenę klimacie Synthwave/lat 80 tworząc interaktywną kolorowankę. Wbudowane GUI umożliwia łatwą manipulację elementami sceny i jej kolorami.",
      "repositoryLink": "https://github.com/SkorczanFFF/Polonez-Autodrive",
      "demoLink": "https://skorczanfff.github.io/Polonez-Autodrive/"
    },
    {
      "title": "YET ANOTHER WEATHER APP",
      "technologies": "React • JavaScript • Sass • Vanta.js • OpenWeather API",
      "description": "'Kolejna Aplikacja Pogodowa', ale z powiewem świeżości. Informacje pogodowe są wyświetlane dla wybranego miasta lub za pomocą geolokacji użytkownika. Interfejs aplikacji został wzbogacony o dodatkowe możliwości interakcji z danymi pogodowymi oraz tłem.",
      "repositoryLink": "https://github.com/SkorczanFFF/YetAnotherWeatherApp",
      "demoLink": "https://skorczanfff.github.io/YetAnotherWeatherApp/"
    }
  ],
  "rodo": "Wyrażam zgodę na przetwarzanie moich danych osobowych dla potrzeb niezbędnych do realizacji procesu rekrutacji (zgodnie z ustawą z dnia 10 maja 2018 roku o ochronie danych osobowych (Dz. Ustaw z 2018, poz. 1000) oraz zgodnie z Rozporządzeniem Parlamentu Europejskiego i Rady (UE) 2016/679 z dnia 27 kwietnia 2016 r. w sprawie ochrony osób fizycznych w związku z przetwarzaniem danych osobowych i w sprawie swobodnego przepływu takich danych oraz uchylenia dyrektywy 95/46/WE (RODO)."
}
