{
  "headers": {
    "about": "O MNIE",
    "contact": "KONTAKT",
    "languages": {
      "languages": "JĘZYKI",
      "english": "Angielski - C1",
      "russian": "Rosyjski - A2",
      "polish": "Polski - ojczysty"
    },
    "links": "LINKI",
    "hobbies": "ZAINTERESOWANIA",
    "experience": "DOŚWIADCZENIE",
    "education": "EDUKACJA",
    "selected-projects": "WYBRANE PROJEKTY",
    "skills": "UMIEJĘTNOŚCI I NARZĘDZIA",
    "download": "POBIERZ"
  },
  "aboutme": "Wszechstronny i otwarty na nowe wyzwania developer, skoncentrowany na tworzeniu angażujących, zorientowanych na użytkownika rozwiązań frontendowych, z solidnym doświadczeniem w pracy po stronie backendu. Posiada umiejętności w zakresie rozwoju Web3 w branży gier oraz tworzenia dedykowanych rozwiązań dla sektora wydarzeń medycznych, oraz silnym zapleczem w obszarze wsparcia IT. Prywatnie pasjonat WebGL, grafiki 3D oraz tworzenia skryptów i narzędzi.",
  "experience": [
    {
      "company": "BUSINESS SERVICE GALOP",
      "position": "Front-End Developer",
      "duration": "Maj 2024 - obecnie",
      "duties": {
        "1": "Aktualizacja i rozbudowa wewnętrznego systemu zarządzania wydarzeniami o nowe funkcjonalności, optymalizacje oraz poprawki błędów; zaprojektowanie nowej strefy uczestnika zintegrowanej ze stronami wydarzeń; stworzenie dedykowanej instancji systemu dostosowanej do potrzeb kluczowego klienta, obsługującej różnorodne kursy i wydarzenia medyczne",
        "2": "Tworzenie dedykowanych rozwiązań front-endowych dla wydarzeń medycznych (dostosowane formularze rejestracyjne i strony internetowe, strefy uczestnika, integracje z API), platformy VOD oraz responsywnych mailingów kompatybilnych ze wszystkimi głównymi usługami pocztowymi",
        "3": "Opracowanie aplikacji mobilnej dla kolektorów danych Zebra (skanowanie kodów QR z lokalnym zapisem danych) oraz aplikacji webowej do rejestracji obecności na sesjach wydarzeń, obsługujących zarówno kioski do samodzielnego skanowania, jak i skanery Zebra",
        "4": "Stworzenie konfigurowalnej aplikacji do głosowania na żywo z panelem administracyjnym i wynikami w czasie rzeczywistym; opracowanie wirtualnych stoisk wystawców z dokumentacją dla firm partnerskich",
        "5": "Świadczenie wsparcia IT na miejscu podczas wydarzeń w całej Polsce, zapewniając płynne działanie systemów i niezawodność sprzętu; pomoc uczestnikom wydarzeń w razie potrzeby, również podczas konferencji międzynarodowych; reprezentowanie działu IT podczas międzynarodowych spotkań oraz okazjonalne pełnienie funkcji kierowcy firmowego"
      }
    },
    {
      "company": "ANFATA GAMES",
      "position": "Junior Web3 Frontend Developer",
      "duration": "Wrzesień 2022 - Sierpień 2023",
      "duties": {
        "1": "Tworzenie zdecentralizowanej aplikacji zintegrowanej ze Smart Contracts i kolekcjami ImmutableX, w tym budowa marketplace’u, mostkowanie NFT między L1 i L2, umożliwienie transferów między kontami oraz wdrożenie systemu aukcji na żywo",
        "2": "Praca z bazami danych Moralis i Firebase oraz funkcjami w chmurze, z wykorzystaniem TypeScript, Next.js, GSAP i systemów kontroli wersji takich jak GitLab i Bitbucket",
        "3": "Wdrożenie nowej strony głównej, integracja bloga opartego na Sanity CMS oraz tworzenie dedykowanych stron i funkcjonalności związanych z wydarzeniami w ramach platform firmy",
        "4": "Manualne testowanie gry Pirates of the Arrland, w tym komponentów 3D MOBA oraz 2D mapy strategicznej w ramach zdecentralizowanej aplikacji",
        "5": "Ścisła współpraca w międzynarodowym i interdyscyplinarnym zespole"
      }
    }
  ],

  "education": {
    "university": "UŚ - Wydział Nauk Ścisłych i Technicznych",
    "field": "INFORMATYKA - Programowanie Aplikacji Webowych",
    "degree": "Inżynier",
    "dates": "Październik 2017 - Czerwiec 2021"
  },
  "projects": [
    {
      "title": "MSKORUS - PORTFOLIO",
      "technologies": "Next.js • TypeScript • TailwindCSS • React Three Fiber/Three.js • Blender",
      "description": "Przebudowana od podstaw przestarzała wersja mojego portfolio. Aktualnie bazuje na Next.js, TypeScript oraz TailwindCSS. Elementy sceny WebGL są modelami wykonanymi w Blender, następnie zostały skonwertowane do komponentów JSX biblioteki React Three Fiber dla prostrzego operowania elementami sceny. Zawiera wbudowaną wersję webową CV w języku polskim i angielskim.",
      "repositoryLink": "https://github.com/SkorczanFFF/mskorus-remaster",
      "demoLink": "https://mskorus.vercel.app/"
    },
    {
      "title": "POLONEZ AUTODRIVE",
      "technologies": "HTML • JavaScript • Three.js • 3D Studio Max 2019",
      "description": "Prosta trójwymiarowa animacja wykonana przy pomocy 3D Studio Max 2019 oraz Three.js. Wyeksportowane modele wraz z animacjami w formacie .fbx zostały połączone w scenę klimacie Synthwave/lat 80 tworząc interaktywną kolorowankę. Wbudowane GUI umożliwia łatwą manipulację elementami sceny i jej kolorami.",
      "repositoryLink": "https://github.com/SkorczanFFF/Polonez-Autodrive",
      "demoLink": "https://polonez-autodrive.vercel.app/"
    },
    {
      "title": "YET ANOTHER WEATHER APP",
      "technologies": "React • JavaScript • Sass • Vanta.js • Open-Meteo API",
      "description": "'Kolejna Aplikacja Pogodowa', ale z powiewem świeżości. Informacje pogodowe są wyświetlane dla wybranego miasta lub za pomocą geolokacji użytkownika. Interfejs aplikacji został wzbogacony o dodatkowe możliwości interakcji z danymi pogodowymi oraz tłem.",
      "repositoryLink": "https://github.com/SkorczanFFF/YetAnotherWeatherApp",
      "demoLink": "https://yet-another-weather-app.vercel.app/"
    }
  ],
  "rodo": "Wyrażam zgodę na przetwarzanie moich danych osobowych dla potrzeb niezbędnych do realizacji procesu rekrutacji (zgodnie z ustawą z dnia 10 maja 2018 roku o ochronie danych osobowych (Dz. Ustaw z 2018, poz. 1000) oraz zgodnie z Rozporządzeniem Parlamentu Europejskiego i Rady (UE) 2016/679 z dnia 27 kwietnia 2016 r. w sprawie ochrony osób fizycznych w związku z przetwarzaniem danych osobowych i w sprawie swobodnego przepływu takich danych oraz uchylenia dyrektywy 95/46/WE (RODO)."
}
